{"Klarna": "\n                Klarna is a Swedish fintech company that provides buy now, pay later\n                (BNPL) services, allowing consumers to split payments into installments\n                or delay payment when shopping online. Founded in 2005, Klarna partners\n                with retailers to offer flexible payment options and also operates\n                as a digital bank in Europe.\n                ", "Bunq": "\n                bunq is a Dutch neobank founded in 2012 that offers mobile-based personal\n                and business banking across Europe. It provides multi-currency accounts,\n                high-interest savings, virtual cards, and investment features through\n                a subscription model. Licensed and supervised in the EU, it operates\n                in over 30 countries.\n                ", "Revolut": "\n                Revolut is a UK-based fintech founded in 2015 that offers app-based banking,\n                payments, and investing services across Europe and beyond. It provides\n                multi-currency accounts, crypto and stock trading, budgeting tools,\n                and travel perks through tiered subscription plans. Though not a\n                traditional bank in all markets, it holds a European banking license and\n                serves over 40 million customers globally.\n                ", "N26": "\n                N26 is a Berlin‑based neobank founded in 2013 and fully licensed\n                in Germany since 2016, offering mobile-only banking with deposit\n                protection up to €100,000 under BaFin supervision. As of early 2025,\n                it serves around 4.8 million active customers across 24 European markets,\n                providing instant real-time banking, sub-accounts, premium tiers,\n                and new features like savings, investing, and crypto trading.\n                ", "Trade Republic": "\n                Trade Republic is a Berlin-based fintech and licensed bank that offers\n                low-cost trading of stocks, ETFs, crypto, and more through a mobile-first\n                platform. It provides commission-free savings plans, fractional investing\n                from €1, and interest on uninvested cash. Active in 17 European countries,\n                it serves over 8 million users.\n                "}